# Built-in functions and import modules

# highest = max(45,98, 46,87,96,41)
highest = max([45,98, 46,87,96,41])
smallest = min([45,98, 46,87,96,41])
total = sum([45,98, 46,87,96,41])
count = len([45,97])
print(highest, smallest,total, count)





# Built In Function::
# পাইথনে অনেকগুলো বিল্ট ইন ফাংশন রয়েছে যেগুলো দিয়ে অনেকগুলো কাজকে সহজেই করে ফেলা যায় এসকল বিল্ট ইন ফাংশন এর লিস্ট এবং ডিটেইলস পেয়ে যাবে এখানে।

# এর মধ্যে কিছু বিল্ট ইন ফাংশন এর বর্ননা নিচে দেওয়া হলো--

# max()::
# এটা যেকোনো আইটেরেবল (লিস্ট, টাপল, স্ট্রিং) থেকে ম্যাক্সিমাম ইলেমেন্ট টাকে বের করে আনে

# highest = max([3,4,5,2])
# print(highest) 
# # output: 5


# min()::
# এটা যেকোনো আইটেরেবল (লিস্ট, টাপল, স্ট্রিং) থেকে মিনিমাম ইলেমেন্ট টাকে বের করে আনে

# highest = min([3,4,5,2])
# print(highest) 
# # output: 2
# এরকম আরো অনেক ফাংশন আছে তোমার কাজ হচ্ছে ফাংশনগুলো পড়ে রান করে দেখা


